tap "homebrew/bundle"
tap "homebrew/core"
# Portable Foreign Function Interface library
brew "libffi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1", link: true
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Programmable completion for Bash 3.2
brew "bash-completion"
# GUI toolkit
brew "gtk+"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# GLib/GObject/GIO Python bindings for Python 2
brew "pygobject"
# GTK+ bindings for Python
brew "pygtk"
# Graphical tool for merging and comparing text files
brew "diffuse"
# C++ template library for linear algebra
brew "eigen"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Library for interacting with JSON
brew "jsoncpp"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Rsync for cloud storage
brew "rclone"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Templatized C++ command-line parser library
brew "tclap"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Internet file retriever
brew "wget"
# Graphical text editor used to maintain a collection of wiki pages
brew "zim"
