tap "brewsci/science"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "m4"
brew "bison"
brew "bzip2"
brew "ca-certificates"
brew "expat"
brew "zlib"
brew "libpng"
brew "freetype"
brew "ncurses"
brew "readline"
brew "icu4c"
brew "libxml2"
brew "gettext"
brew "util-linux"
brew "fontconfig"
brew "gdbm"
brew "libedit"
brew "openssl@1.1"
brew "krb5"
brew "libffi"
brew "libtirpc"
brew "libnsl"
brew "mpdecimal"
brew "pcre2"
brew "sqlite"
brew "unzip"
brew "xz"
brew "python@3.10"
brew "glib"
brew "pkg-config"
brew "libpthread-stubs"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pcre"
brew "pixman"
brew "python@3.9"
brew "cairo"
brew "docbook"
brew "docbook-xsl"
brew "fribidi"
brew "gnu-getopt"
brew "libgpg-error"
brew "libgcrypt"
brew "libtiff"
brew "libxslt"
brew "xmlto"
brew "shared-mime-info"
brew "gdk-pixbuf"
brew "graphite2"
brew "harfbuzz"
brew "lz4"
brew "pango"
brew "zstd"
brew "librsvg"
brew "adwaita-icon-theme"
brew "agedu"
brew "alsa-lib"
brew "aom"
brew "libyaml"
brew "gperf"
brew "ruby"
brew "asciidoctor"
brew "dbus"
brew "libxfixes"
brew "libxi"
brew "libxtst"
brew "at-spi2-core"
brew "atk"
brew "at-spi2-atk"
brew "attr"
brew "berkeley-db"
brew "perl"
brew "autoconf"
brew "bdw-gc"
brew "gmp"
brew "libtool"
brew "libunistring"
brew "guile"
brew "autogen"
brew "automake"
brew "bat"
brew "binutils", link: true
brew "boost"
brew "broot"
brew "brotli"
brew "byacc"
brew "c-ares"
brew "cjson"
brew "clang-format"
brew "cmake"
brew "cmatrix"
brew "cminpack"
brew "cmocka"
brew "coreutils"
brew "six"
brew "cppman"
brew "libevent"
brew "libidn2"
brew "libnghttp2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "cups"
brew "libssh2"
brew "openldap"
brew "rtmpdump"
brew "curl"
brew "dateutils"
brew "dav1d"
brew "diff-so-fancy"
brew "docker"
brew "docutils"
brew "double-conversion"
brew "eigen"
brew "elfutils"
brew "fd"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "hwloc"
brew "open-mpi"
brew "fftw"
brew "libogg"
brew "flac"
brew "frei0r"
brew "giflib"
brew "json-c"
brew "lame"
brew "libvorbis"
brew "opus"
brew "libsndfile"
brew "ladspa-sdk"
brew "little-cms2"
brew "openjpeg"
brew "webp"
brew "leptonica"
brew "libb2"
brew "libarchive"
brew "libass"
brew "libbluray"
brew "libcap"
brew "libice"
brew "mbedtls"
brew "librist"
brew "libsamplerate"
brew "libsodium"
brew "libsoxr"
brew "libvidstab"
brew "libvmaf"
brew "libvpx"
brew "libxcursor"
brew "libxinerama"
brew "libxrandr"
brew "libxscrnsaver"
brew "libxv"
brew "libxxf86vm"
brew "opencore-amr"
brew "speexdsp"
brew "pulseaudio"
brew "rav1e"
brew "vamp-plugin-sdk"
brew "rubberband"
brew "xinput"
brew "sdl2"
brew "snappy"
brew "speex"
brew "srt"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "hdf5"
brew "flann"
brew "flex"
brew "libpciaccess"
brew "libdrm"
brew "wayland"
brew "libva"
brew "libvdpau"
brew "libxdamage"
brew "libxshmfence"
brew "libxvmc"
brew "z3"
brew "llvm"
brew "lm-sensors"
brew "wayland-protocols"
brew "mesa"
brew "mesa-glu"
brew "freeglut"
brew "fzf"
brew "gawk"
brew "gd"
brew "gdb"
brew "jbig2dec"
brew "libidn"
brew "ghostscript"
brew "git-delta"
brew "gl2ps"
brew "glew"
brew "jansson"
brew "global"
brew "gnu-sed"
brew "go"
brew "go-md2man"
brew "gobject-introspection"
brew "gpatch"
brew "jasper"
brew "jpeg", link: true
brew "netpbm"
brew "gts"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "hicolor-icon-theme"
brew "iso-codes"
brew "libepoxy"
brew "xkeyboardconfig"
brew "libxkbcommon"
brew "gtk+3"
brew "gtk-doc"
brew "gtksourceview3"
brew "help2man"
brew "htop"
brew "hyperfine"
brew "intltool"
brew "isl@0.18"
brew "jbig2enc"
brew "jemalloc"
brew "oniguruma"
brew "jq"
brew "jsoncpp"
brew "libassuan"
brew "libmd"
brew "libbsd"
brew "libelf"
brew "libev"
brew "libimagequant"
brew "libksba"
brew "libmaxminddb"
brew "libpcap"
brew "libproxy"
brew "libraqm"
brew "libsecret"
brew "libsm"
brew "libssh"
brew "unibilium"
brew "libtermkey"
brew "systemd"
brew "libusb"
brew "libuv"
brew "libvterm"
brew "libxcomposite"
brew "libxt"
brew "lua"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "ninja"
brew "meson"
brew "mujs"
brew "uchardet"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "msgpack"
brew "nasm"
brew "ncdu"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "netcdf"
brew "nghttp2"
brew "node"
brew "npth"
brew "zip"
brew "openjdk"
brew "tcl-tk"
brew "pillow"
brew "pinentry"
brew "pngquant"
brew "popt"
brew "pugixml"
brew "py3cairo"
brew "pybind11"
brew "pygobject3"
brew "sip"
brew "pyqt-builder"
brew "python@3.8"
brew "qpdf"
brew "ranger"
brew "rapidjson"
brew "rclone"
brew "ripgrep"
brew "xxhash"
brew "rsync"
brew "ruby@2.7"
brew "rust"
brew "rustup-init"
brew "sphinx-doc"
brew "starship"
brew "sxiv"
brew "szip"
brew "tclap"
brew "tmux"
brew "tree"
brew "utf8cpp"
brew "utf8proc"
brew "util-macros"
brew "vala"
brew "xcb-util"
brew "xcb-util-image"
brew "xcb-util-keysyms"
brew "xcb-util-renderutil"
brew "xcb-util-wm"
brew "xdotool"
brew "xtrans"
