tap "brewsci/science"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jstkdng/programs"
tap "zegervdv/zathura"
brew "abseil"
brew "ca-certificates"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "mpdecimal"
brew "openssl@3"
brew "pcre2"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.12"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "cairo"
brew "fribidi"
brew "jpeg-turbo"
brew "lz4"
brew "zstd"
brew "libtiff"
brew "gdk-pixbuf"
brew "graphite2"
brew "icu4c"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "agedu"
brew "brotli"
brew "giflib"
brew "highway"
brew "imath"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "aribb24"
brew "assimp"
brew "dbus"
brew "libxfixes"
brew "libxi"
brew "libxtst"
brew "at-spi2-core"
brew "m4"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion"
brew "libssh2"
brew "oniguruma"
brew "bat"
brew "bazel"
brew "bdw-gc"
brew "berkeley-db"
brew "bison"
brew "boost"
brew "broot"
brew "c-ares"
brew "certifi"
brew "pycparser"
brew "cffi"
brew "cjson"
brew "clang-format"
brew "cliclick"
brew "cmake"
brew "cminpack"
brew "cmocka"
brew "gmp"
brew "coreutils"
brew "jbig2dec"
brew "libidn"
brew "openjpeg"
brew "ghostscript"
brew "jasper"
brew "libpaper"
brew "netpbm"
brew "psutils"
brew "uchardet"
brew "groff"
brew "cppman"
brew "cryptography"
brew "ctags"
brew "dav1d"
brew "desktop-file-utils"
brew "diff-so-fancy"
brew "docbook"
brew "docbook-xsl"
brew "docker-completion"
brew "docker"
brew "docutils"
brew "double-conversion"
brew "eigen"
brew "exiftool"
brew "fd"
brew "imlib2"
brew "libexif"
brew "libice"
brew "libsm"
brew "libxinerama"
brew "libxt"
brew "feh"
brew "libogg"
brew "flac"
brew "frei0r"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "lame"
brew "leptonica"
brew "libb2"
brew "libarchive"
brew "libunibreak"
brew "libass"
brew "libbluray"
brew "libmicrohttpd"
brew "mbedtls"
brew "librist"
brew "libsamplerate"
brew "libvorbis"
brew "mpg123"
brew "opus"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libvidstab"
brew "libvpx"
brew "opencore-amr"
brew "rav1e"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "srt"
brew "svt-av1"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "zeromq"
brew "zimg"
brew "ffmpeg"
brew "ffmpeg@4"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "libaec"
brew "pkg-config"
brew "hdf5"
brew "flann"
brew "fzf"
brew "libavif"
brew "gd"
brew "gdbm"
brew "git"
brew "git-delta"
brew "gl2ps"
brew "glew"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "npth"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gnu-sed"
brew "go"
brew "go-md2man"
brew "gobject-introspection"
brew "gts"
brew "libtool"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "hicolor-icon-theme"
brew "gtk+"
brew "libepoxy"
brew "gtk+3"
brew "gtk-doc"
brew "gtk-mac-integration"
brew "gtksourceview3"
brew "gtksourceview4"
brew "guile"
brew "perl"
brew "help2man"
brew "ncurses"
brew "htop"
brew "hunspell"
brew "hyperfine"
brew "libimagequant"
brew "libraqm"
brew "tcl-tk"
brew "pillow"
brew "qpdf"
brew "img2pdf"
brew "intltool"
brew "jansson"
brew "jbig2enc"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "json-c"
brew "json-glib"
brew "jsoncpp"
brew "libev"
brew "libffi"
brew "libgit2"
brew "libiconv"
brew "libmagic"
brew "libmaxminddb"
brew "libmng"
brew "libnotify"
brew "libpcap"
brew "shaderc"
brew "vulkan-headers"
brew "vulkan-loader"
brew "libplacebo"
brew "libpthread-stubs"
brew "libsmi"
brew "unibilium"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "libyaml"
brew "z3"
brew "llvm"
brew "llvm@13"
brew "lmdb"
brew "lua"
brew "luajit"
brew "luajit-openresty"
brew "luarocks"
brew "luv"
brew "md4c"
brew "ninja"
brew "meson"
brew "protobuf"
brew "mosh"
brew "mujs"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "msgpack"
brew "msmtp"
brew "openssl@1.1"
brew "mysql@5.7"
brew "nasm"
brew "ncdu"
brew "talloc"
brew "xapian"
brew "notmuch"
brew "tokyo-cabinet"
brew "neomutt"
brew "tree-sitter"
brew "neovim"
brew "netcdf"
brew "nghttp2"
brew "node"
brew "nspr"
brew "nss"
brew "pngquant"
brew "pybind11"
brew "unpaper"
brew "ocrmypdf"
brew "openconnect"
brew "openjdk@11"
brew "openldap"
brew "pcre"
brew "poppler"
brew "pugixml"
brew "py3cairo"
brew "pygments"
brew "pygobject3"
brew "qt"
brew "pyqt"
brew "qt@5"
brew "pyqt@5"
brew "python-lxml"
brew "python-packaging"
brew "python-setuptools"
brew "python-tabulate"
brew "python@3.11"
brew "python-tk@3.11"
brew "python@3.10"
brew "python@3.8"
brew "python@3.9"
brew "ranger"
brew "rapidjson"
brew "rclone"
brew "redshift"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "rustup"
brew "scrcpy"
brew "six"
brew "speexdsp"
brew "sphinx-doc"
brew "starship"
brew "swig"
brew "tclap"
brew "wireshark"
brew "termshark"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "urlscan"
brew "utf8cpp"
brew "util-macros"
brew "vala"
brew "vtk"
brew "w3m"
brew "wget"
brew "xtrans"
brew "zim"
brew "jstkdng/programs/ueberzugpp"
brew "zegervdv/zathura/girara"
brew "zegervdv/zathura/zathura"
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "alacritty"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "slack"
cask "whatsapp"
